cask_args appdir: '/Applications'

# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash'
brew 'zsh'
brew 'cask'
brew 'thefuck'
brew 'htop'
brew 'nmap'
brew 'npm'
brew 'node'
brew 'ack'
brew 'coreutils'
brew 'grc'
brew 'git'
brew 'imagemagick'
brew 'figlet'
brew 'jp2a'
brew 'openssl'
brew 'readline'
brew 'trash'
brew 'grep'
brew 'mas'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'redshift'
brew 'yarn'
brew 'youtube-dl'
brew 'python3'
brew 'ffmpeg'

# Apps
cask 'atom'
cask 'handbrake'
cask 'dropbox'
cask 'slack'
cask 'transmission'
cask 'cheatsheet'
cask 'mpv'
cask 'discord'
cask 'google-chrome'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'The Unarchiver', id: 425424353

## Utilities
cask 'transmission' # torrent client
cask 'alfred' # alternative to spotlight
cask 'google-backup-and-sync'
cask 'cyberduck' # ftp
cask 'daisydisk' # visualizes volumes
cask 'balenaetcher' # for USB boot drive creation
cask 'flycut' # clipboard manager
cask 'virtualbox' # VM
cask 'vnc-viewer' # GUI for raspberry pi

## Games
cask 'minecraft'
cask 'openemu' # emulator
cask 'steam'


